[Destructive X2UniversalSoldierClassInfo]
ClassSpecializationTitle="毁灭魔法"
ClassSpecializationSummary="招魂系魔法揭示了魔法的原始力量，并可以非常容易的用它来创造和破坏(灵能衬衣)。"

[Utility X2UniversalSoldierClassInfo]
ClassSpecializationTitle="通用魔法"
ClassSpecializationSummary="魔术师的法术超越了毁灭的范畴，可以用来增强战场上队友的效能(灵能衬衣)。"

[Scion X2UniversalSoldierClassInfo]
ClassSpecializationTitle="血统魔法"
ClassSpecializationSummary="魔法师天生就有魔法天赋(灵能衬衣)。"